Revit 2027 API
IFCUserDefinedPropertySet.Create Method
 Create an IFC user-defined property set with default values.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCUserDefinedPropertySet Create(
	Document document,
	string name
)
Public Shared Function Create (
	document As Document,
	name As String
) As IFCUserDefinedPropertySet
public:
static IFCUserDefinedPropertySet^ Create(
	Document^ document,
	String^ name
)
static member Create :
        document : Document *
        name : string -> IFCUserDefinedPropertySet
Parameters
document Document
 The document where created property set is saved.
name String
 The name specified to this property set.
Return Value
IFCUserDefinedPropertySet
 The new property set instance.
Exceptions
Exception | Condition
ArgumentException |  The name is empty or already exists.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCUserDefinedPropertySet Class
Autodesk.Revit.DB Namespace